Revit 2027 API
StructuralWallUsageFilter Constructor
Overload List
Name | Description
StructuralWallUsageFilter(StructuralWallUsage) |  Constructs a new instance of a filter to match walls that have the given structural wall usage.
StructuralWallUsageFilter(StructuralWallUsage, Boolean) |  Constructs a new instance of a filter to match walls that have the given structural wall usage, with the option to match all walls which are not of the given structural wall usage.
Top
See Also
Reference
StructuralWallUsageFilter Class
Autodesk.Revit.DB.Structure Namespace